# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [2]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

### Step 3. Assign it to a variable called baby_names.

In [3]:
df = pd.read_csv(url)
df.tail()

         Unnamed: 0       Id     Name  Year Gender State  Count
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

### Step 4. See the first 10 entries

(1016395, 7)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

           Name  Year Gender State  Count
1016393  Victor  2014      M    WY      5
1016394  Waylon  2014      M    WY      5

### Step 6. Is there more male or female names in the dataset?

F    0.55
M    0.45
Name: Gender, dtype: float64

True

### Step 7. Group the dataset by name and assign to names

       Year  Count
Name
Aaban  4027     12
Aadan  8039     23

       Count
Name
Aaban     12
Aadan     23

       Count  Year
Name
Aaban     12     2
Aadan     23     4

       Year       Count
        min   max   sum
Name
Aaban  2013  2014    12
Aadan  2008  2014    23

### Step 8. How many different names exist in the dataset?

17632

17632

### Step 9. What is the name with most occurrences?

'Jacob'

        Count
Name
Jacob  242874

Name
Jacob    242874
Name: Count, dtype: int64

### Step 10. How many different names have the least occurrences?

'Aadarsh'

(2578, 1)

### Step 11. What is the median name occurrence?

49.0

### Step 12. What is the standard deviation of names?

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

           count     mean    std     min     25%     50%     75%     max
Year   1016395.0  2009.05   3.14  2004.0  2006.0  2009.0  2012.0  2014.0
Count  1016395.0    34.85  97.40     5.0     7.0    11.0    26.0  4167.0